greet = "Привіт, {name}, я бот, використовуючий нейронні мережі від OpenAI, такі як ChatGPT і Dall-e. Задавай мені питання і я спробую відповісти ☺️"
menu = "📍 Головне меню"

gen_text = "📝 Відправте текст запиту для нейронної мережі для генерації текста"
gen_image = "🖼 Відправте текст запиту для нейронної мережі для генерації зображення"
gen_exit = "Щоб вийти з діалогу нажміть на кнопку нижче"
gen_error = f'🚫 Помилка генерації. Можливі причини:\n1. Перегружені сервера OpenAI\n2. Ваш запит порушив правила OpenAI\n3. Помилка в роботі бота\nЯкщо ви вважаєте, що проблема викликана неисправністю бота, повідомте адміністратора'
text_watermark = '\n_______________________________________\nСтворено за допомоги @SmartixTraderBot'
img_watermark = "Створено за допомоги @SmartixTraderBot"
gen_wait = "⏳Будь ласка, почекайте, поки нейронна мережа обробляє ваш запит..."

err = "🚫 На жаль  сталась помилка, спробуйте пізніше"

help_t="Якщо у вас виникли проблеми з роботою нашого боту напишіть нам за адресою:  help@gmail.com"
